def get_recommendations(domain):

    mapping = {

        "Склад и запасы": [
            "ABC-анализ",
            "XYZ-анализ",
            "Неликвиды"
        ],

        "Бюджетирование": [
            "План-Факт",
            "Отклонения",
            "Структура расходов"
        ],

        "Продажи": [
            "ABC клиентов",
            "ABC товаров",
            "Сезонность"
        ]
    }

    return mapping.get(
        domain,
        [
            "Статистика",
            "ТОП-анализ"
        ]
    )
