def get_recommendations(domain):

    if domain == "Склад и запасы":
        return [
            "ABC-анализ",
            "XYZ-анализ",
            "Анализ остатков",
            "Неликвиды"
        ]

    if domain == "Бюджетирование":
        return [
            "План-Факт",
            "Отклонения",
            "Структура расходов"
        ]

    if domain == "Продажи":
        return [
            "ABC клиентов",
            "ABC товаров",
            "Сезонность"
        ]

    return [
        "Статистический анализ",
        "ТОП-анализ"
    ]
